# SketchedRunInvalidPath Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SketchFailures..::..SketchedRunInvalidPath Property
BuiltInFailures..::..SketchFailures Class See Also
---
Invalid stair path. Stair path should connect both start and end riser, and cross all other risers.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId SketchedRunInvalidPath { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SketchedRunInvalidPath As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ SketchedRunInvalidPath {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SketchFailures Class
Autodesk.Revit.DB Namespace